const data = {
    install : {
        text1 : 'Create React App არის კომფორტული გარემო React-ის შესასწავლად და ერთერთი გზა React-ში ახალი, ერთგვერდიანი აპლიკაციის შესაქმნელად.',
        text2 : 'ის ქმნის სამუშაო გარემოს ისე, რომ თქვენ შეგიძლიათ გამოიყენოთ JavaScript-ის უახლესი ფუნქციები, უზრუნველყოფს დეველოპერის სასიამოვნო გამოცდილებას React-თან მუშაობისას და ოპტიმიზაციას უკეთებს თქვენს აპლიკაციას. თქვენს კომპიუტერში უნდა გქონდეთ  დაინსტალირებული  ',
        text3 : ' Node >= 14.0.0 და npm >= 5.6.',
        text4 : ' პროექტის შესაქმნელად, ტერმინალში გაუშვით შემდეგი ბრძანებები:',
        text5 : 'პირველ სტრიქონზე npx არ გეგონოთ შეცდომა — ეს არის პაკეტების გაშვების ინსტრუმენტი, რომელიც npm-ში გაჩნდა 5.2+ ვერსიიდან.',
        text6 : 'Create React App არ ამუშავებს backend-ის და მონაცემთა ბაზების ლოგიკას; ის ქმნის frontend-იდან მონაცემების გამტარს, რომლებიც შემდეგ თქვენ შეგიძლიათ გამოიყენოთ ნებისმიერ backend ტექნოლოგიაში. Create React App იყენებს ',
        text7 : ' თუმცა ამ ეტაპზე თქვენ არ გჭირდებათ მათ შესახებ სიღრმისეული ცოდნა.',
        text8 : 'როდესაც თქვენი აპლიკაცია მზად იქნება,  ტერმინალში უნდა გაშვათ npm run build ბრძანება, რომელიც თქვენს პროექტში ახალ build საქაღალდეში შექმნის აპლიკაციის ოპტიმიზებულ კონსტრუქციას.'
    },
    article1 : {
        text1 : 'React-ის აპლიკაციის ყველაზე მცირე მაგალითი ასე გამოიყურება:',
        text2 : 'ვებ გვერდზე გამოჩნდება წარწერა:  “Hello, world!”',
        text3 : 'დააჭირეთ ზემოთ მოცემულ ბმულს კოდის ონლაინ რედაქტორის გასახსნელად. თავისუფლად შეიტანეთ კოდში ცვლილებები და ნახეთ, როგორ იმოქმედებს ისინი მიღებულ შედეგზე. ამ სახელმძღვანელოს გვერდების უმეტესობას ექნება მსგავსი რედაქტირებადი მაგალითები.',
        text4 : 'როგორ გამოვიყენოთ ეს სახელმძღვანელო',
        text5 : 'ამ სახელმძღვანელოში ჩვენ განვიხილავთ React-ის აპლიკაციების სამშენებლო ბლოკებს: ელემენტებს და კომპონენტებს. მას შემდეგ რაც მათ დაეუფლებით,  შეგეძლებათ შექმნათ რთული აპლიკაციები მცირე, მრავალჯერადი გამოყენების ნაწილებისგან.',
        text6 : 'ეს სახელმძღვანელო განკუთვნილია მათთვის, ვინც უპირატესობას ანიჭებს React-ის კონცეპციების სწავლას ეტაპობრივად, ნაბიჯ-ნაბიჯ.',
        text7 : 'სახელმძღვანელოს პირველ ნაწილში განხილულია React-ის ძირითადი კონცეფციები. სხვა განყოფილებების სია თქვენ შეგიძლიათ ნახოთ ნავიგაციის პანელში, მარჯვენა გვერდითა ზოლში.',
        text8 : 'სახელმძღვანელოს ყოველი ნაწილი ეფუძვნება წინა ნაწილებში გავლილ მასალას. თქვენ შეგიძლიათ გაეცნოთ React-ის მთავარ ნაწილს „ძირითადი კონცეფციების“  თავის გავლით და შემდეგ გაყვეთ თავებს იმ თანმიმდევრობით, როგორც ისინი არიან დალაგებული ნავიგაციის პანელში. მაგალითად, შემდეგი თავი არის  - "JSX-თან გაცნობა".',
        text9 : 'React – JavaScript-ის ბიბლიოთეკაა, ამიტომ ამ სახელმძღვანელოს გასავლელად თქვენ გჭირდებათ JavaScript ენის საბაზისო ცოდნა. თუკი თქვენ ვერ გძნობთ საკმარის თავდაჯერებულობას JavaScript-ში, გირჩევთ საკუთარი ცოდნის გასაახლებლად გაეცნოთ მითითებულ ბმულზე განთავსებულ '        
    }
}

export default data